# Найдите сумму цифр трехзначного числа.
#
# *Пример:*
#
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

numer = int(input('Введите шестизначное число-номер вашего билета:  '))
tile_1 = numer//1000
tile_2 = numer%1000

S1 = tile_1//100+tile_1%10+tile_1%100//10
S2 = tile_2//100+tile_2%10+tile_2%100//10

if S1 == S2:
    print('Ваш номер счастливый')
else:
    print('Ваш номер несчастливый')
